文档/测试工作相关/IT端到端测试相关/测试内容相关/2020/20200514/互联网专线新增路由模式和交换模式（206242766）/报文查询结果/WMZ2020050905427424专线宽带新装_PAL报文查询结果.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:san="http://sanss.com" xmlns:java="java:com.sanss.ibp.nonphs.ra.system97" xmlns:java1="java:com.sanss.ibp.nonphs.ra.common">
	<soapenv:Body>
		<san:createIntResService>
			<san:createIntResServiceRequest>
				<java:WpRequestBasicInfo>
					<java:CrmProductId>482</java:CrmProductId>
					<java:CrmQuoteNumber>WMZ2020050905427424</java:CrmQuoteNumber>
					<java:CrmVersion>1</java:CrmVersion>
					<java:DoType>do</java:DoType>
					<java:EventIdP6>1588989516730</java:EventIdP6>
					<java:P6OrderId>52785</java:P6OrderId>
					<java:P6Version>1.0.0.0.0</java:P6Version>
					<java:SubActionCode>Z01</java:SubActionCode>
					<java:ProcessDesc>Z01</java:ProcessDesc>
					<java:ProcessType>Z</java:ProcessType>
					<java:UserId>EIP200052017</java:UserId>
					<java:WpError/>
					<java:WpStatus/>
					<java:WpType>lan</java:WpType>
					<java:P6Source>crm</java:P6Source>
					<java:P6Type>lan_zz_crm</java:P6Type>
				</java:WpRequestBasicInfo>
				<java:NewProduct>
					<java:Name>lan</java:Name>
					<java:Aid>400145596552</java:Aid>
					<java:Properties>
						<java1:Name>channel_flag</java1:Name>
						<java1:Value>自营实体</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>sub_channel_flag</java1:Name>
						<java1:Value>自营营业厅</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>crm_product_name</java1:Name>
						<java1:Value>专网上网</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>service_account</java1:Name>
						<java1:Value>ZQ20200508</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>account_price_type</java1:Name>
						<java1:Value>政企</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>account_price_sub_type</java1:Name>
						<java1:Value>个体</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>account_number</java1:Name>
						<java1:Value>400000165644</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>account_primary_identity_number</java1:Name>
						<java1:Value>98276512334</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>account_primary_identity_type</java1:Name>
						<java1:Value>护照</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>property_account</java1:Name>
						<java1:Value>ZQ20200508</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>service_account_number</java1:Name>
						<java1:Value>400000165644</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>address_full</java1:Name>
						<java1:Value>上海市普陀区桃浦镇武威路2238号22层2201室</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>address_id</java1:Name>
						<java1:Value>1040348787</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>contact_person</java1:Name>
						<java1:Value>ZQ20200508</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>contact_tel</java1:Name>
						<java1:Value>18700921123</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>sub_bureau_code</java1:Name>
						<java1:Value>057</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>bureau_code</java1:Name>
						<java1:Value>5</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>crm_product_code</java1:Name>
						<java1:Value>482</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>note</java1:Name>
						<java1:Value>||</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>is_open_dmz_func</java1:Name>
						<java1:Value>1</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>is_load_extend_serv</java1:Name>
						<java1:Value>1</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>ip_address_no</java1:Name>
						<java1:Value>2</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>sp_access_type</java1:Name>
						<java1:Value>1</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>sp_speed</java1:Name>
						<java1:Value>R</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>sp_online_access_mode</java1:Name>
						<java1:Value>EPON</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>sp_contact_email</java1:Name>
						<java1:Value>alonso@qq.com</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>oriental_psw</java1:Name>
						<java1:Value>512334</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>IP_Address_Protocol_Type</java1:Name>
						<java1:Value>IPv4 only</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>p_crm_order_no</java1:Name>
						<java1:Value>400145555559</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>p_crm_source</java1:Name>
						<java1:Value>1</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>p_new_crm_product_code</java1:Name>
						<java1:Value>10000315543</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>p_new_crm_product_name</java1:Name>
						<java1:Value>专线宽带</java1:Value>
					</java:Properties>
					<java:Properties>
						<java1:Name>user_access_mode</java1:Name>
						<java1:Value>路由模式</java1:Value>
					</java:Properties>
				</java:NewProduct>
			</san:createIntResServiceRequest>
		</san:createIntResService>
	</soapenv:Body>
</soapenv:Envelope>